# CutLineDistance Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CutLineDistance Property
ParameterTypeId Class See Also
---
"Cut Line Distance"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CutLineDistance { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CutLineDistance As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CutLineDistance {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace